In [2]:
import numpy as np
import pandas as pd

In [3]:
import numpy as np
import pandas as pd
data = pd.DataFrame({'A':[3,np.nan,np.nan],
                  'B':[5,7,np.nan],
                  'C':[4,2,7]})
data

     A    B  C
0  3.0  5.0  4
1  NaN  7.0  2
2  NaN  NaN  7

The DataFrame data is given above.  How to drop all columns that have missing values?

In [5]:
data.dropna(axis=1, inplace=True)

In [6]:
data

   C
0  4
1  2
2  7

In [7]:
data = pd.DataFrame([('bird', 389.0),
                     ('bird', 40.0), ('bird', 405.0),
                     ('mammal', 80.2),
                     ('mammal', 12.0),('mammal', 58)],
                     index=['falcon', 'parrot', 'eagle', 'lion', 'monkey', 'leopard'],
                    columns=('class', 'speed'))
data

          class  speed
falcon     bird  389.0
parrot     bird   40.0
eagle      bird  405.0
lion     mammal   80.2
monkey   mammal   12.0
leopard  mammal   58.0

The DataFrame data is given above.  How to calculate the standard deviation of speed for birds and mammals using  groupby method? You should get the following table.

	speed
class	
bird	206.269242
mammal	34.785246

In [9]:
data.groupby('class').std()

             speed
class
bird    206.269242
mammal   34.785246

The DataFrame data is given above.  How to get the following table?

                                                                                speed
       count	      mean	      std	 min	  25%	 50%	75%	 max
class								
bird	3.0	278.000000	206.269242	40.0	214.5	389.0	397.0	405.0
mammal	3.0	50.066667	34.785246	12.0	35.0

In [10]:
data.groupby("class").describe()

       speed
       count        mean         std   min    25%    50%    75%    max
class
bird     3.0  278.000000  206.269242  40.0  214.5  389.0  397.0  405.0
mammal   3.0   50.066667   34.785246  12.0   35.0   58.0   69.1   80.2